let dec = 123 // 10-кова система
let hex = 0x7b // 0x - префікс 16-кової системи. Саме число - 7b
let bin = 0b1111011 // 0b - префікс 2-кової системи. Саме число - 1111011
let oct = 0o173 // 0o - префікс 8-кової системи. Саме число - 173



// Найчастіше ми будем працювати з десятковими числами. Їх теж можна записати кількома способами:

let x = 15 // ціле десяткове число
let y = 0.52 // число з дробовою частиною
let z = 3.14e6 // e6 означає помножити на 10 в 6 ступені, тобто наше число 3140000. 